# Pandas

Pandas is a package used for managing data.

Pandas main use is that it creates 2 new data types for storing data: series and dataframe.

Think of a pandas dataframe like an excel spreadsheet that is storing some data.  One column can have customer name, one column can have product sold name, another column can have price or quantity... Then the rows could be individual sales.

A dataframe is made up of several series.  Each column of a dataframe is a series.

We can name each column and row of a dataframe.

A pandas dataframe is very similar to a data.frame in R.

Similar to numpy arrays, a dataframe is a more robust data type for storing data than lists of lists. Dataframes are more flexible than numpy arrays.

A numpy array can create a matrix with all entries of the same data type.  In a dataframe each column can have its own datatype.  

That's not to say numpy arrays aren't useful.  It is often easiest to convert some subset of a dataframe to a numpy array and then use that to do some math.

Pandas also has SQL-like functions for merging, joining, and sorting dataframes.

In [110]:
import pandas as pd
import numpy as np  # numpy is not necessary for pandas, but we will use some np code in this example
# in general it's good practice to import all pacakages at the beginning

In [111]:
# first let's look at series - think of this as a single column of a spreadsheet
# each entry in a series corresponds to an individual row in the spreadsheet
# we can create a series by converting a list, or numpy array

mylist = [5.4,6.1,1.7,99.8]
myarray = np.array(mylist)

In [112]:
myseries1 = pd.Series(data=mylist)
print(myseries1)
myseries2 = pd.Series(data=myarray)
print(myseries2)

0     5.4
1     6.1
2     1.7
3    99.8
dtype: float64
0     5.4
1     6.1
2     1.7
3    99.8
dtype: float64

In [113]:
# we access individual entries the same way as with lists and arrays
print(myseries1[2])

1.7

In [114]:
# we can add labels to the entries of a series

mylabels = ['first','second','third','fourth']
myseries3 = pd.Series(data=mylist,index=mylabels)
print(myseries3)

first      5.4
second     6.1
third      1.7
fourth    99.8
dtype: float64

In [115]:
# we need not be explicit about the entries of pd.Series
myseries4 = pd.Series(mylist,mylabels)
print(myseries4)

first      5.4
second     6.1
third      1.7
fourth    99.8
dtype: float64

In [116]:
# we can also access entries using the index labels
print(myseries4['second'])

6.1

In [117]:
# we can do math on series 
myseries5 = pd.Series([5.5,1.1,8.8,1.6],['first','third','fourth','fifth'])
print(myseries5)
print('')
print(myseries5+myseries4)

first     5.5
third     1.1
fourth    8.8
fifth     1.6
dtype: float64

fifth       NaN
first      10.9
fourth    108.6
second      NaN
third       2.8
dtype: float64

In [118]:
# we can combine series to create a dataframe using the concat function
myseries6 = pd.Series([5.33,1.33,8.38,1.36],['first','third','fourth','fifth'])
df1 = pd.concat([myseries4,myseries5,myseries6],axis=1,sort=False)
df1

           0    1     2
first    5.4  5.5  5.33
second   6.1  NaN   NaN
third    1.7  1.1  1.33
fourth  99.8  8.8  8.38
fifth    NaN  1.6  1.36

In [119]:
# we can create a new dataframe 
df2 = pd.DataFrame(np.random.randn(5,5))
df2

          0         1         2         3         4
0 -0.312116 -0.482742 -1.536695  0.047087  0.510523
1  1.962017  0.968134  0.929426 -1.096018  1.330104
2 -0.396457  2.356027  0.713810  0.785894  0.511183
3 -2.587416 -0.984819  0.463117 -0.866700  1.399232
4 -0.350281  0.137226 -2.703255 -0.709532  0.403487

In [120]:
# lets give labels to rows and columns
df3 = pd.DataFrame(np.random.randn(5,5),index=['first row','second row','third row','fourth row','fifth row'],
                   columns=['first col','second col','third col','fourth col','fifth col'])
df3

            first col  second col  third col  fourth col  fifth col
first row    1.316653    1.413693   0.171806    0.187611  -2.478024
second row   1.085612   -1.813593  -1.503513   -0.040388   0.340287
third row   -0.772247    2.376246  -0.199511    0.076589   0.646343
fourth row   0.927099    1.295097   2.369121    1.680019  -1.170628
fifth row   -0.569863    0.832195   0.030759    0.899712   0.481380

In [121]:
# we can access individual series in a data frame
print(df3['second col'])
print('')
df3[['third col','first col']]

first row     1.413693
second row   -1.813593
third row     2.376246
fourth row    1.295097
fifth row     0.832195
Name: second col, dtype: float64

            third col  first col
first row    0.171806   1.316653
second row  -1.503513   1.085612
third row   -0.199511  -0.772247
fourth row   2.369121   0.927099
fifth row    0.030759  -0.569863

In [123]:
# we can access rows of a dataframe
df3.loc['fourth row']

first col     0.927099
second col    1.295097
third col     2.369121
fourth col    1.680019
fifth col    -1.170628
Name: fourth row, dtype: float64

In [124]:
df3.iloc[2]

first col    -0.772247
second col    2.376246
third col    -0.199511
fourth col    0.076589
fifth col     0.646343
Name: third row, dtype: float64

In [93]:
df3.loc[['fourth row','first row'],['second col','third col']]

            second col  third col
fourth row   -1.089002   1.155111
first row     0.847313  -0.499840

In [125]:
# we can use logical indexing for dataframes just like for numpy arrays
df3>0

            first col  second col  third col  fourth col  fifth col
first row        True        True       True        True      False
second row       True       False      False       False       True
third row       False        True      False        True       True
fourth row       True        True       True        True      False
fifth row       False        True       True        True       True

In [126]:
print(df3[df3>0])

            first col  second col  third col  fourth col  fifth col
first row    1.316653    1.413693   0.171806    0.187611        NaN
second row   1.085612         NaN        NaN         NaN   0.340287
third row         NaN    2.376246        NaN    0.076589   0.646343
fourth row   0.927099    1.295097   2.369121    1.680019        NaN
fifth row         NaN    0.832195   0.030759    0.899712   0.481380

In [241]:
# we can add columns to a dataframe
df3['sixth col'] = np.random.randn(5,1)
df3

            second col  third col  fourth col  fifth col  sixth col
first row     1.413693   0.171806    0.187611  -2.478024   0.577559
second row   -1.813593  -1.503513   -0.040388   0.340287  -0.898352
third row     2.376246  -0.199511    0.076589   0.646343   0.781048
fourth row    1.295097   2.369121    1.680019  -1.170628  -0.089012
fifth row     0.832195   0.030759    0.899712   0.481380   0.204289

In [242]:
# we can remove columns or rows from a dataframe
df3.drop('first col',axis=1,inplace=True)

KeyError: "['first col'] not found in axis"

In [129]:
df3

            second col  third col  fourth col  fifth col  sixth col
first row     1.413693   0.171806    0.187611  -2.478024   0.240757
second row   -1.813593  -1.503513   -0.040388   0.340287  -0.025196
third row     2.376246  -0.199511    0.076589   0.646343  -0.910038
fourth row    1.295097   2.369121    1.680019  -1.170628   0.194257
fifth row     0.832195   0.030759    0.899712   0.481380   1.257609

In [131]:
df5 = df3.drop('second row',axis=0)
df5

            second col  third col  fourth col  fifth col  sixth col
first row     1.413693   0.171806    0.187611  -2.478024   0.240757
third row     2.376246  -0.199511    0.076589   0.646343  -0.910038
fourth row    1.295097   2.369121    1.680019  -1.170628   0.194257
fifth row     0.832195   0.030759    0.899712   0.481380   1.257609

In [132]:
# we can remove a dataframe's index labels
df5.reset_index()

        index  second col  third col  fourth col  fifth col  sixth col
0   first row    1.413693   0.171806    0.187611  -2.478024   0.240757
1   third row    2.376246  -0.199511    0.076589   0.646343  -0.910038
2  fourth row    1.295097   2.369121    1.680019  -1.170628   0.194257
3   fifth row    0.832195   0.030759    0.899712   0.481380   1.257609

In [133]:
df5

            second col  third col  fourth col  fifth col  sixth col
first row     1.413693   0.171806    0.187611  -2.478024   0.240757
third row     2.376246  -0.199511    0.076589   0.646343  -0.910038
fourth row    1.295097   2.369121    1.680019  -1.170628   0.194257
fifth row     0.832195   0.030759    0.899712   0.481380   1.257609

In [134]:
df5.reset_index(inplace=True)
df5

        index  second col  third col  fourth col  fifth col  sixth col
0   first row    1.413693   0.171806    0.187611  -2.478024   0.240757
1   third row    2.376246  -0.199511    0.076589   0.646343  -0.910038
2  fourth row    1.295097   2.369121    1.680019  -1.170628   0.194257
3   fifth row    0.832195   0.030759    0.899712   0.481380   1.257609

In [135]:
# we can assign new names to the index
df5['new name'] = ['This','is','the','row']
df5

,index,second col,third col,fourth col,fifth col,sixth col,new name
0,first row,1.413693,0.171806,0.187611,-2.478024,0.240757,This
1,third row,2.376246,-0.199511,0.076589,0.646343,-0.910038,is
2,fourth row,1.295097,2.369121,1.680019,-1.170628,0.194257,the
3,fifth row,0.832195,0.030759,0.899712,0.481380,1.257609,row

In [136]:
df5.set_index('new name',inplace=True)
df5

               index  second col  third col  fourth col  fifth col  sixth col
new name
This       first row    1.413693   0.171806    0.187611  -2.478024   0.240757
is         third row    2.376246  -0.199511    0.076589   0.646343  -0.910038
the       fourth row    1.295097   2.369121    1.680019  -1.170628   0.194257
row        fifth row    0.832195   0.030759    0.899712   0.481380   1.257609

# Combining data frames

The ways dataframes are combined in pandas is similar to SQL

We will examine 3 methods for combining dataframes

1. concat
2. join
3. merge

In [145]:


df7 = pd.DataFrame({"customer":['101','102','103','104'], 
                    'category': ['cat2','cat2','cat1','cat3'],
                    'important': ['yes','no','yes','yes'],
                    'sales': [123,52,214,663]},index=[0,1,2,3])

df8 = pd.DataFrame({"customer":['101','103','104','105'], 
                    'color': ['yellow','green','green','blue'],
                    'distance': [12,9,44,21],
                    'sales': [123,214,663,331]},index=[4,5,6,7])

In [146]:
pd.concat([df7,df8],axis=0,sort=False)

  customer category important  sales   color  distance
0      101     cat2       yes    123     NaN       NaN
1      102     cat2        no     52     NaN       NaN
2      103     cat1       yes    214     NaN       NaN
3      104     cat3       yes    663     NaN       NaN
4      101      NaN       NaN    123  yellow      12.0
5      103      NaN       NaN    214   green       9.0
6      104      NaN       NaN    663   green      44.0
7      105      NaN       NaN    331    blue      21.0

In [140]:
pd.concat([df7,df8],axis=0,sort=True)

  category   color customer  distance important  sales
0     cat2     NaN      101       NaN       yes    123
1     cat2     NaN      102       NaN        no     52
2     cat1     NaN      103       NaN       yes    214
3     cat3     NaN      104       NaN       yes    663
4      NaN  yellow      101      12.0       NaN    123
5      NaN   green      103       9.0       NaN    214
6      NaN   green      104      44.0       NaN    663
7      NaN    blue      105      21.0       NaN    331

In [141]:
pd.concat([df7,df8],axis=1,sort=False)

  customer category important  sales customer   color  distance  sales
0      101     cat2       yes  123.0      NaN     NaN       NaN    NaN
1      102     cat2        no   52.0      NaN     NaN       NaN    NaN
2      103     cat1       yes  214.0      NaN     NaN       NaN    NaN
3      104     cat3       yes  663.0      NaN     NaN       NaN    NaN
4      NaN      NaN       NaN    NaN      101  yellow      12.0  123.0
5      NaN      NaN       NaN    NaN      103   green       9.0  214.0
6      NaN      NaN       NaN    NaN      104   green      44.0  663.0
7      NaN      NaN       NaN    NaN      105    blue      21.0  331.0

# Merge and Join

Merge combines dataframes using a column's values to identify common entries

Join combines dataframes using the index to identify common entries

In [147]:
pd.merge(df7,df8,how='outer',on='customer') # outer merge is union of on

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes    123.0  yellow      12.0    123.0
1      102     cat2        no     52.0     NaN       NaN      NaN
2      103     cat1       yes    214.0   green       9.0    214.0
3      104     cat3       yes    663.0   green      44.0    663.0
4      105      NaN       NaN      NaN    blue      21.0    331.0

In [148]:
pd.merge(df7,df8,how='inner',on='customer') # inner merge is intersection of on

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes      123  yellow        12      123
1      103     cat1       yes      214   green         9      214
2      104     cat3       yes      663   green        44      663

In [149]:
pd.merge(df7,df8,how='right',on='customer') # left merge is just first on, but all columns ... right is second

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes    123.0  yellow        12      123
1      103     cat1       yes    214.0   green         9      214
2      104     cat3       yes    663.0   green        44      663
3      105      NaN       NaN      NaN    blue        21      331

In [154]:
df9 = pd.DataFrame({'Q1': [101,102,103],
                    'Q2': [201,202,203]},
                   index=['I0','I1','I2'])

df10 = pd.DataFrame({'Q3': [301,302,303],
                    'Q4': [401,402,403]},
                   index=['I0','I2','I3'])

In [153]:
# join behaves just like merge, 
# except instead of using the values of one of the columns 
# to combine data frames, it uses the index labels
df9.join(df10,how='inner') # outer, inner, left, and right work the same as merge

     Q1   Q2   Q3   Q4
I0  101  201  301  401
I2  103  203  302  402

In [156]:
# let's now go over a few more basic functialities of pandas
print(df8)
df8['color'].unique()

  customer   color  distance  sales
4      101  yellow        12    123
5      103   green         9    214
6      104   green        44    663
7      105    blue        21    331

array(['yellow', 'green', 'blue'], dtype=object)

In [157]:
df8['color'].value_counts()

green     2
blue      1
yellow    1
Name: color, dtype: int64

In [159]:
print(df9)
df9.mean()

     Q1   Q2
I0  101  201
I1  102  202
I2  103  203

Q1    102.0
Q2    202.0
dtype: float64

In [160]:
df8.columns

Index(['customer', 'color', 'distance', 'sales'], dtype='object')

In [164]:
print(df8)
print(df9)

  customer   color  distance  sales
4      101  yellow        12    123
5      103   green         9    214
6      104   green        44    663
7      105    blue        21    331
     Q1   Q2
I0  101  201
I1  102  202
I2  103  203

In [165]:
new_df = df8[(df8['customer']!='105') & (df8['color']!='green')]
new_df

  customer   color  distance  sales
4      101  yellow        12    123

In [166]:
print(df8['sales'].mean())
print(df8['distance'].min())

332.75
9

In [171]:
def profit(s):
    return s*0.5 # 50% markup...

In [172]:
df8

  customer   color  distance  sales
4      101  yellow        12    123
5      103   green         9    214
6      104   green        44    663
7      105    blue        21    331

In [169]:
df8['sales'].apply(profit)

4     61.5
5    107.0
6    331.5
7    165.5
Name: sales, dtype: float64

In [173]:
df8['color'].apply(len)

4    6
5    5
6    5
7    4
Name: color, dtype: int64

In [175]:
df11 = df8[['distance','sales']]
print(df11)
df11.applymap(profit)

   distance  sales
4        12    123
5         9    214
6        44    663
7        21    331

   distance  sales
4       6.0   61.5
5       4.5  107.0
6      22.0  331.5
7      10.5  165.5

In [178]:
df11

   distance  sales
4        12    123
5         9    214
6        44    663
7        21    331

In [180]:
def col_sum(co):
    return sum(co)
df11.apply(col_sum)

distance      86
sales       1331
dtype: int64

In [182]:
del df8['color']
df8

  customer  distance  sales
4      101        12    123
5      103         9    214
6      104        44    663
7      105        21    331

In [183]:
df8.index

Int64Index([4, 5, 6, 7], dtype='int64')

In [188]:
df8.sort_values(by='distance')
df8

  customer  distance  sales
5      103         9    214
4      101        12    123
7      105        21    331
6      104        44    663

In [189]:
df8

  customer  distance  sales
5      103         9    214
4      101        12    123
7      105        21    331
6      104        44    663

In [190]:
# if some series has multiple of the same value then we can group all the unique entries together
mydict = {'customer': ['Customer 1','Customer 1','Customer2','Customer2','Customer3','Customer3'], 
          'product1': [1.1,2.1,3.8,4.2,5.5,6.9],
          'product2': [8.2,9.1,11.1,5.2,44.66,983]}
df6 = pd.DataFrame(mydict,index=['Purchase 1','Purchase 2','Purchase 3','Purchase 4','Purchase 5','Purchase 6'])
df6

              customer  product1  product2
Purchase 1  Customer 1       1.1      8.20
Purchase 2  Customer 1       2.1      9.10
Purchase 3   Customer2       3.8     11.10
Purchase 4   Customer2       4.2      5.20
Purchase 5   Customer3       5.5     44.66
Purchase 6   Customer3       6.9    983.00

In [192]:
grouped_data = df6.groupby('customer')
print(grouped_data)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x10BD1850>

In [194]:
grouped_data.describe()

           product1                                           product2  \
              count mean       std  min   25%  50%   75%  max    count
customer
Customer 1      2.0  1.6  0.707107  1.1  1.35  1.6  1.85  2.1      2.0
Customer2       2.0  4.0  0.282843  3.8  3.90  4.0  4.10  4.2      2.0
Customer3       2.0  6.2  0.989949  5.5  5.85  6.2  6.55  6.9      2.0


              mean         std    min      25%     50%      75%    max
customer
Customer 1    8.65    0.636396   8.20    8.425    8.65    8.875    9.1
Customer2     8.15    4.171930   5.20    6.675    8.15    9.625   11.1
Customer3   513.83  663.506577  44.66  279.245  513.83  748.415  983.0

In [210]:
df8

  customer  distance  sales
5      103         9    214
4      101        12    123
7      105        21    331
6      104        44    663

In [211]:
# similar to numpy arrays, we can also save and load dataframes to csv files, and also Excel files

df8.to_csv('df8.csv',index=True)

In [217]:
new_df8 = pd.read_csv('df8.csv',index_col=0)
new_df8

   customer  distance  sales
5       103         9    214
4       101        12    123
7       105        21    331
6       104        44    663

In [ ]:
df8.to_excel('df8.xlsx',index=False,sheet_name='first sheet')
newer_df8 = pd.read_excel('df8.xlsx',sheet_name='first sheet',index_col=1)
newer_df8

In [228]:
demo_array = np.arange(0,10)
demo_array[demo_array <6]

array([0, 1, 2, 3, 4, 5])

In [230]:
demo_matrix = np.array(([13,35,74,48], [23,37,37,38],[73,39,93,39]))
demo_matrix[:, (1,2)]

array([[35, 74],
       [37, 37],
       [39, 93]])

In [232]:
test_array = [10, 11.5, 12, 13.5, 14,15]  
test_array[2:3]

[12]

In [233]:
list_l =[[12,34,55,],[66,45,77],[45,77,88]]
np.array(list_l)

array([[12, 34, 55],
       [66, 45, 77],
       [45, 77, 88]])

In [234]:
score = [10, 15, 20, 25]
pd.Series(data=score, index = ['a','b','c','d'])

a    10
b    15
c    20
d    25
dtype: int64

In [236]:
np.arange(0,22,6)

array([ 0,  6, 12, 18])

In [238]:
demo_array = np.arange(10,21)
subset_demo_array = demo_array[0:7]
subset_demo_array[:]= 101
subset_demo_array

array([101, 101, 101, 101, 101, 101, 101])

In [243]:
flowers = pd.Series([2, 3, 5, 4], index=['lily', 'rose', 'daisy', 'lotus'])
flowers['daisy']

5

In [250]:
s1 = pd.Series(['a', 'b'])
s2 = pd.Series(['c', 'd'])
pd.concat([s1,s2])

0    a
1    b
0    c
1    d
dtype: object

In [253]:
football = [24, 235, 34, 456, 65, 67]

type(football)

arr = np.array(football)
arr

array([ 24, 235,  34, 456,  65,  67])